PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/lpc43_usb0dev.c
/*******************************************************************************
 * Private Function Prototypes
 *******************************************************************************/

/* Register operations ********************************************************/

#if defined(CONFIG_LPC43_USBDEV_REGDEBUG) && defined(CONFIG_DEBUG)
static uint32_t lpc43_getreg(uint32_t addr);
static void lpc43_putreg(uint32_t val, uint32_t addr);
#else
# define lpc43_getreg(addr)     getreg32(addr)
# define lpc43_putreg(val,addr) putreg32(val,addr)
#endif

static inline void lpc43_clrbits(uint32_t mask, uint32_t addr);
static inline void lpc43_setbits(uint32_t mask, uint32_t addr);
static inline void lpc43_chgbits(uint32_t mask, uint32_t val, uint32_t addr);

/* Request queue operations ****************************************************/

static FAR struct lpc43_req_s *lpc43_rqdequeue(FAR struct lpc43_ep_s *privep);
static bool       lpc43_rqenqueue(FAR struct lpc43_ep_s *privep,
                    FAR struct lpc43_req_s *req);

/* Low level data transfers and request operations *****************************/

static inline void lpc43_writedtd(struct lpc43_dtd_s *dtd, const uint8_t *data,
                     uint32_t nbytes);
static inline void lpc43_queuedtd(uint8_t epphy, struct lpc43_dtd_s *dtd);
static inline void lpc43_ep0xfer(uint8_t epphy, uint8_t *data, uint32_t nbytes);
static void        lpc43_readsetup(uint8_t epphy, struct usb_ctrlreq_s *ctrl);

static inline void lpc43_set_address(struct lpc43_usbdev_s *priv, uint16_t address);

static void        lpc43_flushep(struct lpc43_ep_s *privep);

static int         lpc43_progressep(struct lpc43_ep_s *privep);
static inline void lpc43_abortrequest(struct lpc43_ep_s *privep,
                     struct lpc43_req_s *privreq, int16_t result);
static void        lpc43_reqcomplete(struct lpc43_ep_s *privep,
                     struct lpc43_req_s *privreq, int16_t result);

static void        lpc43_cancelrequests(struct lpc43_ep_s *privep, int16_t status);

/* Interrupt handling **********************************************************/
static struct lpc43_ep_s *lpc43_epfindbyaddr(struct lpc43_usbdev_s *priv,
                     uint16_t eplog);
static void        lpc43_dispatchrequest(struct lpc43_usbdev_s *priv,
                     const struct usb_ctrlreq_s *ctrl);
static void        lpc43_ep0configure(struct lpc43_usbdev_s *priv);
static void        lpc43_usbreset(struct lpc43_usbdev_s *priv);

static inline void lpc43_ep0state(struct lpc43_usbdev_s *priv, uint16_t state);
static void        lpc43_ep0setup(struct lpc43_usbdev_s *priv);

static void        lpc43_ep0complete(struct lpc43_usbdev_s *priv, uint8_t epphy);
static void        lpc43_ep0nak(struct lpc43_usbdev_s *priv, uint8_t epphy);
static bool        lpc43_epcomplete(struct lpc43_usbdev_s *priv, uint8_t epphy);

static int         lpc43_usbinterrupt(int irq, FAR void *context);

/* Endpoint operations *********************************************************/

/* USB device controller operations ********************************************/

static int  lpc43_epconfigure(FAR struct usbdev_ep_s *ep,
              const struct usb_epdesc_s *desc, bool last);
static int  lpc43_epdisable(FAR struct usbdev_ep_s *ep);
static FAR struct usbdev_req_s *lpc43_epallocreq(FAR struct usbdev_ep_s *ep);
static void lpc43_epfreereq(FAR struct usbdev_ep_s *ep,
              FAR struct usbdev_req_s *);
#ifdef CONFIG_ARCH_USBDEV_DMA
static void *lpc43_epallocbuffer(FAR struct usbdev_ep_s *ep, unsigned bytes);
static void lpc43_epfreebuffer(FAR struct usbdev_ep_s *ep, FAR void *buf);
#endif
static int  lpc43_epsubmit(FAR struct usbdev_ep_s *ep,
              struct usbdev_req_s *req);
static int  lpc43_epcancel(FAR struct usbdev_ep_s *ep,
              struct usbdev_req_s *req);
static int  lpc43_epstall(FAR struct usbdev_ep_s *ep, bool resume);

static FAR struct usbdev_ep_s *lpc43_allocep(FAR struct usbdev_s *dev,
              uint8_t epno, bool in, uint8_t eptype);
static void lpc43_freeep(FAR struct usbdev_s *dev, FAR struct usbdev_ep_s *ep);
static int  lpc43_getframe(struct usbdev_s *dev);
static int  lpc43_wakeup(struct usbdev_s *dev);
static int  lpc43_selfpowered(struct usbdev_s *dev, bool selfpowered);
static int  lpc43_pullup(struct usbdev_s *dev, bool enable);

/*******************************************************************************
 * Private Data
 *******************************************************************************/

/* Since there is only a single USB interface, all status information can be
 * be simply retained in a single global instance.
 */

static struct lpc43_usbdev_s g_usbdev;

static struct lpc43_dqh_s __attribute__((aligned(2048))) g_qh[LPC43_NPHYSENDPOINTS];
static struct lpc43_dtd_s __attribute__((aligned(32)))   g_td[LPC43_NPHYSENDPOINTS];

static const struct usbdev_epops_s g_epops =
{
  .configure   = lpc43_epconfigure,
  .disable     = lpc43_epdisable,
  .allocreq    = lpc43_epallocreq,
  .freereq     = lpc43_epfreereq,
#ifdef CONFIG_ARCH_USBDEV_DMA
  .allocbuffer = lpc43_epallocbuffer,
  .freebuffer  = lpc43_epfreebuffer,
#endif
  .submit      = lpc43_epsubmit,
  .cancel      = lpc43_epcancel,
  .stall       = lpc43_epstall,
};

static const struct usbdev_ops_s g_devops =
{
  .allocep     = lpc43_allocep,
  .freeep      = lpc43_freeep,
  .getframe    = lpc43_getframe,
  .wakeup      = lpc43_wakeup,
  .selfpowered = lpc43_selfpowered,
  .pullup      = lpc43_pullup,
};

/*******************************************************************************
 * Public Data
 *******************************************************************************/

/*******************************************************************************
 * Private Functions
 *******************************************************************************/

/*******************************************************************************
 * Name: lpc43_getreg
 *
 * Description:
 *   Get the contents of an LPC433x register
 *
 *******************************************************************************/

#if defined(CONFIG_LPC43_USBDEV_REGDEBUG) && defined(CONFIG_DEBUG)
static uint32_t lpc43_getreg(uint32_t addr)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval = 0;
  static uint32_t count = 0;

  /* Read the value from the register */

  uint32_t val = getreg32(addr);

